In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('empleados.csv', delimiter=";")

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143 entries, 0 to 142
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Edad         143 non-null    int64
 1   Experiencia  143 non-null    int64
 2   Salario      143 non-null    int64
dtypes: int64(3)
memory usage: 3.5 KB
None

In [4]:
df

     Edad  Experiencia  Salario
0      22            3     2423
1      26            5     2639
2      35           10     3122
3      35           13     3431
4      54           18     3962
..    ...          ...      ...
138    29            4     2510
139    22            4     2530
140    30            6     2760
141    44           15     3616
142    37           11     3245

[143 rows x 3 columns]

In [5]:
df.mean()

Edad             33.797203
Experiencia       6.867133
Salario        2778.657343
dtype: float64